# St7MoveByIncrement

Moves selected entities by increment.

long St7MoveByIncrement(long uID, double* DXYZ, long UCSId)

Input Parameters

uID

Strand7 model file ID.

DXYZ[0..2]

Increment.

UCSId

UCS in which increment has been provided.

Dependencies
Selection

Entities can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.